%   Нечёткая аппроксимация завуисимости: y=x1^2 - x2^2 и др.
%                                                      (LR_1_FuzzyApr_ZD.m)
%==========================================================================
close all
%---------------------------------------------
% Построение графика функции  y=-x1^2 - x2^2
% в области    x1 e [-8, 8];  x2 e [-6, 6]
%---------------------------------------------

n = 15;         % количество точек дискретизации

% ********************************* Var_7 ***

x1 = linspace(-8, 8, n);
x2 = linspace(-8, 8, n);

for i = 1:n
    yx(i,:) = -x1.^2 - x2(i).^2;   
end 
%---------------------------------------------
h8 = figure(8);
%set(h8,'Position',[1020  392   330   260])
surf(x1, x2, yx)
axis([min(x1)  max(x1) ...
      min(x2)  max(x2)  ...
      min(min(yx))  max(max(yx)) ]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Var 7') 
